[
    {
        "start_time": 0.0,
        "text": " Good evening, this is Rahul Redeva live here from Houston, Texas."
    },
    {
        "start_time": 5.36,
        "text": " Every Tuesday we do bring an immigration update."
    },
    {
        "start_time": 7.86,
        "text": " Along with me is my business partner Emily Newman."
    },
    {
        "start_time": 10.2,
        "text": " Emily, what do we have today to discuss?"
    },
    {
        "start_time": 12.88,
        "text": " Today we want to talk about this idea of a $5 million gold, maybe green card."
    },
    {
        "start_time": 19.48,
        "text": " What exactly could it be and is it something that's going"
    },
    {
        "start_time": 23.1,
        "text": " to replace employment-based green cards?"
    },
    {
        "start_time": 25.46,
        "text": " We'll also be talking about this new registration requirement."
    },
    {
        "start_time": 29.36,
        "text": " Who needs to register and how exactly that works?"
    },
    {
        "start_time": 34.04,
        "text": " The G325R is the form for that."
    },
    {
        "start_time": 36.96,
        "text": " How do you complete it?"
    },
    {
        "start_time": 37.86,
        "text": " What are some of the questions that you may be unfamiliar with how to answer?"
    },
    {
        "start_time": 42.5,
        "text": " We'll also talk about whether B2 is still an option for people who have terminated their employment"
    },
    {
        "start_time": 49.36,
        "text": " when they're on H1B or L1 or other non-immigrant statuses and want to have more"
    },
    {
        "start_time": 54.5,
        "text": " than just the usual 60-day grace period."
    },
    {
        "start_time": 57.3,
        "text": " And then last we're going to talk about fixing your I-94 if it expires early based"
    },
    {
        "start_time": 64.66,
        "text": " on your passport expiration instead of based on when your most recent I-797 approval expires."
    },
    {
        "start_time": 72.28,
        "text": " What are the options depending on when you realize that your date is different?"
    },
    {
        "start_time": 77.5,
        "text": " And most importantly, remind everyone to please, please, please,"
    },
    {
        "start_time": 80.86,
        "text": " every time you enter the country when you're on a non-immigrant visa, go to the CBP website"
    },
    {
        "start_time": 86.36,
        "text": " and look at your I-94."
    },
    {
        "start_time": 87.96,
        "text": " We talked about it in our attorney meeting today and one of the attorneys said,"
    },
    {
        "start_time": 91.46,
        "text": " yeah, they should do it like while they're walking away, step off to the side, pull up your phone,"
    },
    {
        "start_time": 97.82,
        "text": " go to that website, enter in your information and check the I-94 to make sure you were entered"
    },
    {
        "start_time": 102.46,
        "text": " in the correct status too because we've started seeing people accidentally being entered"
    },
    {
        "start_time": 108.22,
        "text": " as a B non-immigrant's business visa or tourist visa when they were actually on a work visa"
    },
    {
        "start_time": 113.46,
        "text": " and they didn't find out about it until months later."
    },
    {
        "start_time": 115.76,
        "text": " So that's the important thing and then why is it the date is shortened and how can you fix it?"
    },
    {
        "start_time": 122.28,
        "text": " First thing, Emily, is it a green card?"
    },
    {
        "start_time": 124.4,
        "text": " You're telling it's a green card."
    },
    {
        "start_time": 126.32,
        "text": " The way I hear it is it's a gold card."
    },
    {
        "start_time": 128.6,
        "text": " It's different than green card."
    },
    {
        "start_time": 129.92,
        "text": " The reason I say is that because when he expressed about the gold card though,"
    },
    {
        "start_time": 137.24,
        "text": " he clearly mentioned it is quite different that of the green card."
    },
    {
        "start_time": 142.06,
        "text": " He definitely said it's better than green card in some senses."
    },
    {
        "start_time": 146.58,
        "text": " It's going to lead to the citizenship."
    },
    {
        "start_time": 148.3,
        "text": " That's what he told."
    },
    {
        "start_time": 150.22,
        "text": " One thing that he said is that in generally the green card, Emily, is if the worldwide income"
    },
    {
        "start_time": 156.54,
        "text": " you're supposed to report it and you're supposed to pay the income tax on it."
    },
    {
        "start_time": 161.42,
        "text": " Let's say, for example, somebody made a million dollars in Dubai, the UAE."
    },
    {
        "start_time": 167.06,
        "text": " They don't have income taxes at all there."
    },
    {
        "start_time": 170.32,
        "text": " So if you are a green card holder, they made $1 million in UAE."
    },
    {
        "start_time": 175.44,
        "text": " They are supposed to pay the full income tax in the United States."
    },
    {
        "start_time": 179.2,
        "text": " Now, in India, for example, if they made a million dollars, India collects income taxes."
    },
    {
        "start_time": 184.48,
        "text": " They have to pay the difference if there is anything in the United States."
    },
    {
        "start_time": 188.72,
        "text": " So especially if the people are coming from the Middle Eastern countries, so then they will have"
    },
    {
        "start_time": 193.36,
        "text": " to pay the entire taxes if they have a green card."
    },
    {
        "start_time": 196.46,
        "text": " However, this gold card, the way it's expressed to me was that, no, they don't have to pay the worldwide income."
    },
    {
        "start_time": 203.58,
        "text": " Now, of course, it's not passed in the Senate yet."
    },
    {
        "start_time": 208.1,
        "text": " It's not passed."
    },
    {
        "start_time": 208.98,
        "text": " It's not even proposed at this point of time."
    },
    {
        "start_time": 211.3,
        "text": " He said he's going to unveil the things in two weeks, which is almost one week is already over."
    },
    {
        "start_time": 218.9,
        "text": " He says that he can make $5 trillion with that."
    },
    {
        "start_time": 222.5,
        "text": " I've never got a single call."
    },
    {
        "start_time": 224.52,
        "text": " Hey, Rahul, I have $5 million to spare."
    },
    {
        "start_time": 227.0,
        "text": " Can you get me the gold card?"
    },
    {
        "start_time": 228.64,
        "text": " I didn't have anybody calling me yet."
    },
    {
        "start_time": 230.76,
        "text": " But of course, I do get a lot of people calling me."
    },
    {
        "start_time": 233.52,
        "text": " Hey, what's going to happen to the employment-based green cards?"
    },
    {
        "start_time": 236.24,
        "text": " He says that he's going to earn $5 trillion by selling this gold card."
    },
    {
        "start_time": 242.2,
        "text": " We lost $4 trillion."
    },
    {
        "start_time": 244.56,
        "text": " If you count the stock loss today, it's going to be $5 trillion lost in the stock market in the past one week."
    },
    {
        "start_time": 252.42,
        "text": " I wouldn't say Trump or anything, but anyway, coming to the point $5 trillion since the stock market is lost,"
    },
    {
        "start_time": 257.78,
        "text": " I don't know about gaining it."
    },
    {
        "start_time": 259.66,
        "text": " I haven't had a single person calling and asking, Rahul, give me the $5 million green card."
    },
    {
        "start_time": 266.7,
        "text": " Yet, I do have a lot of people who are panicked and they said, hey, what about EB-5?"
    },
    {
        "start_time": 271.3,
        "text": " What about the employment-based green card?"
    },
    {
        "start_time": 273.78,
        "text": " The way he said is that we are giving out the green cards free."
    },
    {
        "start_time": 277.18,
        "text": " We should be selling them."
    },
    {
        "start_time": 279.12,
        "text": " Does it mean that he's going to cancel the existing EB-5 or the entire employment-based green card,"
    },
    {
        "start_time": 284.52,
        "text": " or entire family-based green card, and only give the green cards to the people who are going to be willing to buy it at $5 million?"
    },
    {
        "start_time": 293.6,
        "text": " I'm going to say no."
    },
    {
        "start_time": 295.84,
        "text": " He doesn't plan on eliminating the employment-based green card, the family-based green card."
    },
    {
        "start_time": 302.24,
        "text": " I think it's questionable whether he will replace the EB-5 program with this gold card."
    },
    {
        "start_time": 309.52,
        "text": " But the EB-5 program is created by Congress in 1990."
    },
    {
        "start_time": 314.76,
        "text": " Only Congress can get rid of it or modify it."
    },
    {
        "start_time": 318.96,
        "text": " He's going to need to go through the legislative process."
    },
    {
        "start_time": 323.0,
        "text": " Currently, EB-5 is not set to sunset until 2027."
    },
    {
        "start_time": 327.96,
        "text": " We've got the next two years, unless Congress does something, the president can't eliminate that."
    },
    {
        "start_time": 334.14,
        "text": " They're going through the budget process now, trying to come up with some sort of budget or continuing resolution to a government shutdown by the end of the week."
    },
    {
        "start_time": 344.54,
        "text": " So far, I don't think there's been any mention of the gold card being in this budget,"
    },
    {
        "start_time": 352.46,
        "text": " which is the only way we can see them fast-tracking, getting this up and running in the next two weeks."
    },
    {
        "start_time": 358.84,
        "text": " So it's hard to say."
    },
    {
        "start_time": 360.04,
        "text": " Is this all just him talking like he said he's going to staple green cards to the back of diplomas when people graduate?"
    },
    {
        "start_time": 367.24,
        "text": " Or does he actually have a plan?"
    },
    {
        "start_time": 369.16,
        "text": " Now, he did have the secretary of commerce is involved in this."
    },
    {
        "start_time": 375.52,
        "text": " Kind of his brainchild is what it sounds like."
    },
    {
        "start_time": 378.44,
        "text": " So maybe he's got a little more planning underway and is just keeping it quiet for now."
    },
    {
        "start_time": 385.26,
        "text": " So yeah, I don't think I'm not worried that like EB-2, EB-3, EB-1 is going away."
    },
    {
        "start_time": 393.66,
        "text": " I don't think EB-5 is going away in the near future."
    },
    {
        "start_time": 397.3,
        "text": " I think this will be in addition to as a way to bring in some money and help balance the budget temporarily."
    },
    {
        "start_time": 407.36,
        "text": " Okay. At this point of time, those people who are panicked about EB-5, you can still file the EB-5 application."
    },
    {
        "start_time": 414.0,
        "text": " We do not expect EB-5 to go anywhere."
    },
    {
        "start_time": 416.72,
        "text": " We do not expect EB-2, EB-1, EB-3 employment-based applications to go anywhere."
    },
    {
        "start_time": 422.0,
        "text": " We do not expect the immediate relative family applications to go anywhere."
    },
    {
        "start_time": 426.12,
        "text": " There may be some effect on the refugee things, asylum things, but not in the family base."
    },
    {
        "start_time": 431.62,
        "text": " All those things probably need to go through Congress though."
    },
    {
        "start_time": 435.22,
        "text": " So I don't think so. They're going anywhere at this point of time."
    },
    {
        "start_time": 440.78,
        "text": " Emily, as we know that we have an initiative where the administration is telling that every immigrant has to be registered in USA."
    },
    {
        "start_time": 453.38,
        "text": " Every person who is a non-immigrant in the United States has to be registered in USA."
    },
    {
        "start_time": 459.4,
        "text": " Every person who is illegally staying in the United States has to register in USA. Otherwise, it's a crime."
    },
    {
        "start_time": 467.8,
        "text": " Of course, most of all our audiences are legal immigrants, so we can address only legal immigration."
    },
    {
        "start_time": 473.32,
        "text": " If anybody is undocumented present here, we definitely want you to contact an immigration lawyer."
    },
    {
        "start_time": 478.24,
        "text": " But for those people who are documentarily are non-immigrant status here in the United States,"
    },
    {
        "start_time": 486.06,
        "text": " they said very clearly anybody who has an I-94 was being issued when they entered into the United States."
    },
    {
        "start_time": 492.86,
        "text": " Their I-94 has been extended. They don't have to register because they're considered to have been already registered though."
    },
    {
        "start_time": 500.58,
        "text": " However though, there is a certain class of people, Emily, which need to be registered."
    },
    {
        "start_time": 507.66,
        "text": " Is that if at the time when they entered into the United States, their biometrics are not being done."
    },
    {
        "start_time": 514.48,
        "text": " Especially for the children who are under 14 years, the biometrics is not done."
    },
    {
        "start_time": 519.52,
        "text": " And they turned above 14 after coming into the United States. They need to register. Is that right, Emily?"
    },
    {
        "start_time": 526.12,
        "text": " Correct, yeah. And they say that going forward, anyone who's in that situation needs to register."
    },
    {
        "start_time": 533.32,
        "text": " Their parents need to register them within 30 days of their 14th birthday."
    },
    {
        "start_time": 538.58,
        "text": " I think where the question comes in is what about kids who already turned 14 while they were in the U.S. who, you know, before this regulation takes effect."
    },
    {
        "start_time": 552.3,
        "text": " And so I think, you know, based on our discussions, we don't really see any downside of registering them in this new process."
    },
    {
        "start_time": 561.86,
        "text": " It's a pretty straightforward form. You're just providing employment history, which there generally won't be any for kids who just turned 14."
    },
    {
        "start_time": 570.36,
        "text": " Address, history, parents, information."
    },
    {
        "start_time": 574.24,
        "text": " And then once you submit that, they will receive an appointment for biometrics, go in and get the biometrics,"
    },
    {
        "start_time": 581.04,
        "text": " and then they'll be able to download proof that they have registered."
    },
    {
        "start_time": 585.64,
        "text": " So at this point, for people who've already turned 14 and are trying to comply with this rule, would you suggest that they go ahead if they are lawfully here?"
    },
    {
        "start_time": 596.98,
        "text": " Yes, I would recommend that they register before 30 days from February 25th. That's when the notification was issued."
    },
    {
        "start_time": 606.46,
        "text": " We are going to provide a link to my USCIS account."
    },
    {
        "start_time": 610.6,
        "text": " We're going to the form that you need to fill. There is called G325R, which I have filled it myself. It's very easy."
    },
    {
        "start_time": 621.32,
        "text": " The questions, the little bit controversial questions that are there other than what Emily said is their father's name, mother's name,"
    },
    {
        "start_time": 628.4,
        "text": " did a birth and employment information, which I don't think so. There should be any employment information of the 14 or the children."
    },
    {
        "start_time": 636.62,
        "text": " And the issue was that what is the purpose of your visit? What is the purpose why you're staying in the United States?"
    },
    {
        "start_time": 645.12,
        "text": " Since the child, if you disagree with my statement, please don't make the statement in the form."
    },
    {
        "start_time": 652.44,
        "text": " Most of the children who are here are to accompany the parents and go to school."
    },
    {
        "start_time": 659.44,
        "text": " That is the purpose for which they are staying in the United States, according to me."
    },
    {
        "start_time": 663.64,
        "text": " But you can make the statement if that is the correct statement."
    },
    {
        "start_time": 667.56,
        "text": " They also have the intended date they leave the country."
    },
    {
        "start_time": 672.92,
        "text": " They can put the expiration date of their H4 or an anonymous visa."
    },
    {
        "start_time": 678.3,
        "text": " And they can say that, that they can extend it based on their parents staying in the United States."
    },
    {
        "start_time": 684.58,
        "text": " They can extend it beyond that period of time."
    },
    {
        "start_time": 686.82,
        "text": " These are the two questions I see a little bit confusing, which I answered it to you."
    },
    {
        "start_time": 693.46,
        "text": " I'm going to give the link of the MyUSCI account."
    },
    {
        "start_time": 696.46,
        "text": " I'm going to give the link of the form number also."
    },
    {
        "start_time": 698.9,
        "text": " I will list it out in the YouTube."
    },
    {
        "start_time": 700.78,
        "text": " It will be done by tomorrow."
    },
    {
        "start_time": 702.3,
        "text": " You will have a note of that."
    },
    {
        "start_time": 703.32,
        "text": " It's called G325R that you need to register."
    },
    {
        "start_time": 707.52,
        "text": " It's a very simple form that everybody use."
    },
    {
        "start_time": 711.2,
        "text": " Now, if you have a doubt whether your child has already been biometrics,"
    },
    {
        "start_time": 716.08,
        "text": " has been already done or not, just register."
    },
    {
        "start_time": 720.12,
        "text": " It's not going to happen."
    },
    {
        "start_time": 721.12,
        "text": " For example, if somebody has already done the biometrics and they registered it,"
    },
    {
        "start_time": 725.16,
        "text": " it's not going to cause any problem for them."
    },
    {
        "start_time": 727.28,
        "text": " So go ahead and register it because it's very simple."
    },
    {
        "start_time": 730.58,
        "text": " We have done this in 2000, Emily."
    },
    {
        "start_time": 734.5,
        "text": " You were there, right, Emily?"
    },
    {
        "start_time": 735.54,
        "text": " 2000?"
    },
    {
        "start_time": 736.54,
        "text": " Yeah, with NCRs."
    },
    {
        "start_time": 737.94,
        "text": " Yeah, NCRs."
    },
    {
        "start_time": 739.14,
        "text": " Yeah, in 2000, we have done this registration before."
    },
    {
        "start_time": 742.7,
        "text": " When the September 11th happened, they have to register."
    },
    {
        "start_time": 745.1,
        "text": " Everybody was undocumented."
    },
    {
        "start_time": 747.02,
        "text": " We have gone with some of the people and helped them register also."
    },
    {
        "start_time": 751.18,
        "text": " I had no issues."
    },
    {
        "start_time": 752.34,
        "text": " So please go and register everybody."
    },
    {
        "start_time": 753.94,
        "text": " This is only, we are speaking of the non-immigrant people who are in United States,"
    },
    {
        "start_time": 758.86,
        "text": " who have turned 14 after their biometrics has not been done."
    },
    {
        "start_time": 763.44,
        "text": " So please have them registered very soon, though."
    },
    {
        "start_time": 768.28,
        "text": " Don't delay that one."
    },
    {
        "start_time": 770.32,
        "text": " Yeah, and the specific wording of those questions that might be a little confusing"
    },
    {
        "start_time": 774.64,
        "text": " are, since entry, what activities have you been engaged in?"
    },
    {
        "start_time": 779.84,
        "text": " In what activities do you intend to engage in between now and"
    },
    {
        "start_time": 783.72,
        "text": " the expected date of your departure?"
    },
    {
        "start_time": 786.2,
        "text": " How long do you expect to remain in the United States?"
    },
    {
        "start_time": 789.06,
        "text": " And then what is your expected date of departure?"
    },
    {
        "start_time": 792.02,
        "text": " And so, Raul provided kind of what you can state in those situations,"
    },
    {
        "start_time": 795.98,
        "text": " assuming that that is accurate information."
    },
    {
        "start_time": 798.82,
        "text": " But certainly, kids are here accompanying their parents and"
    },
    {
        "start_time": 803.7,
        "text": " their expiration date is going to be the date that's on their I-94,"
    },
    {
        "start_time": 807.42,
        "text": " the most recent one."
    },
    {
        "start_time": 809.42,
        "text": " I don't think there's any issue, if I put that my, I'm planning on staying here for"
    },
    {
        "start_time": 815.02,
        "text": " three years and then three years from now I file an extension."
    },
    {
        "start_time": 818.6,
        "text": " Do they need to update their registration?"
    },
    {
        "start_time": 820.52,
        "text": " I don't think so."
    },
    {
        "start_time": 821.88,
        "text": " I think this is just providing the information today as it is today so"
    },
    {
        "start_time": 825.6,
        "text": " that you can get a fingerprinting appointment."
    },
    {
        "start_time": 828.64,
        "text": " I see the question coming from Casey."
    },
    {
        "start_time": 830.52,
        "text": " My child went to India and came back at 15 years of age, still in registration."
    },
    {
        "start_time": 835.84,
        "text": " You have a doubt, guys, just register."
    },
    {
        "start_time": 838.48,
        "text": " It's easier."
    },
    {
        "start_time": 839.96,
        "text": " It's online, there's not much there in there."
    },
    {
        "start_time": 844.12,
        "text": " So if you have a doubt, register."
    },
    {
        "start_time": 845.82,
        "text": " So but technically speaking up, if they've gone to the biometrics there in"
    },
    {
        "start_time": 849.98,
        "text": " India, they don't need to."
    },
    {
        "start_time": 852.02,
        "text": " But just in case if you have any doubt, just register."
    },
    {
        "start_time": 855.74,
        "text": " That's an easy way to answer the question."
    },
    {
        "start_time": 859.06,
        "text": " And we're going to provide the link by tomorrow, guys."
    },
    {
        "start_time": 861.54,
        "text": " The link at my USHR's website and the form number we're going to provide it by tomorrow."
    },
    {
        "start_time": 868.26,
        "text": " All right, next topic for people who've been laid off and"
    },
    {
        "start_time": 872.0,
        "text": " still happening that are on H1B is converting to a B2."
    },
    {
        "start_time": 876.8,
        "text": " Still a good option."
    },
    {
        "start_time": 878.48,
        "text": " Is it the best option?"
    },
    {
        "start_time": 879.72,
        "text": " Are we recommending anything different than what we've been doing for"
    },
    {
        "start_time": 882.48,
        "text": " the last two or three years?"
    },
    {
        "start_time": 884.32,
        "text": " Absolutely, very good option."
    },
    {
        "start_time": 886.6,
        "text": " If you want to stay in United States legally and you want to search for"
    },
    {
        "start_time": 890.28,
        "text": " the job legally, USCIS has created a web, in the website,"
    },
    {
        "start_time": 895.2,
        "text": " they strongly recommended people you can apply for the B2."
    },
    {
        "start_time": 899.2,
        "text": " Normally what we do is that, let's say you get laid off on January 30th."
    },
    {
        "start_time": 906.3,
        "text": " You have 60 days if you're in the forestry valid, that is up to March 30th for"
    },
    {
        "start_time": 911.34,
        "text": " you to stay in United States."
    },
    {
        "start_time": 913.22,
        "text": " After that, you are out of status."
    },
    {
        "start_time": 916.22,
        "text": " Your risk period ends in 60 days."
    },
    {
        "start_time": 918.3,
        "text": " So by March 30th, you can find the H1B starting on March 30th,"
    },
    {
        "start_time": 923.34,
        "text": " ending on September 30th."
    },
    {
        "start_time": 926.06,
        "text": " So that will be six months from the time of March 30th."
    },
    {
        "start_time": 929.36,
        "text": " You can stay in the country."
    },
    {
        "start_time": 930.4,
        "text": " So the total period you can stay in the country, 60 days per year,"
    },
    {
        "start_time": 934.0,
        "text": " plus six months, assuming that the grace period time is covered and"
    },
    {
        "start_time": 938.04,
        "text": " you have the I-94, which is valid for the 60 days."
    },
    {
        "start_time": 940.84,
        "text": " So the total time that you can spend is eight months."
    },
    {
        "start_time": 944.64,
        "text": " The reason we recommend is that if you get a job in this eight months,"
    },
    {
        "start_time": 948.92,
        "text": " in this period of time though, you can convert back into H1B without"
    },
    {
        "start_time": 954.2,
        "text": " leaving the country."
    },
    {
        "start_time": 955.04,
        "text": " That's a good part about it."
    },
    {
        "start_time": 956.86,
        "text": " We have done so many people B2 applications."
    },
    {
        "start_time": 960.46,
        "text": " If you want, you can consult us."
    },
    {
        "start_time": 962.06,
        "text": " We normally tell people to fill all the form."
    },
    {
        "start_time": 964.3,
        "text": " We will prepare and give you the written statement and"
    },
    {
        "start_time": 967.42,
        "text": " all the documents that you may submit."
    },
    {
        "start_time": 969.9,
        "text": " We strongly recommend people if there's an option."
    },
    {
        "start_time": 973.34,
        "text": " You can leave the country."
    },
    {
        "start_time": 975.5,
        "text": " If you want to stay in the country, the best option definitely would be converting"
    },
    {
        "start_time": 979.86,
        "text": " into B2."
    },
    {
        "start_time": 980.78,
        "text": " If you want to leave the country, you can leave."
    },
    {
        "start_time": 982.38,
        "text": " You can always come back."
    },
    {
        "start_time": 983.54,
        "text": " If you have any H1B left over, you can come back on that H1B."
    },
    {
        "start_time": 988.36,
        "text": " For those people, the question mainly comes is, hey,"
    },
    {
        "start_time": 991.92,
        "text": " can I convert back into H1B?"
    },
    {
        "start_time": 993.52,
        "text": " I have used only four years of H1B."
    },
    {
        "start_time": 996.0,
        "text": " Can I come back on H1B transfer and use the two years when I'm in the B2?"
    },
    {
        "start_time": 1000.72,
        "text": " The answer is yes."
    },
    {
        "start_time": 1002.28,
        "text": " Also the questions that come is, my I-140 is approved."
    },
    {
        "start_time": 1005.56,
        "text": " Can I still go to B2?"
    },
    {
        "start_time": 1007.08,
        "text": " The answer is yes, you can."
    },
    {
        "start_time": 1008.92,
        "text": " You can still apply the B2 and you can always convert back into H1B at"
    },
    {
        "start_time": 1013.1,
        "text": " a later date."
    },
    {
        "start_time": 1013.9,
        "text": " Absolutely no problem at all."
    },
    {
        "start_time": 1016.18,
        "text": " For people who are searching for jobs, they can stay."
    },
    {
        "start_time": 1019.18,
        "text": " Can you search for jobs while you're on B2?"
    },
    {
        "start_time": 1021.58,
        "text": " Absolutely you can."
    },
    {
        "start_time": 1023.1,
        "text": " Based on the USAS website, that link that we normally provide when we file the B2"
    },
    {
        "start_time": 1028.06,
        "text": " application for USAS officer, yes, you can look for the jobs while you are on a B2 application."
    },
    {
        "start_time": 1033.86,
        "text": " Compared to the B2, for someone who's got an approved I-140,"
    },
    {
        "start_time": 1040.86,
        "text": " is the compelling circumstances I-140, EAD a better option because it gives you work"
    },
    {
        "start_time": 1046.86,
        "text": " authorization or is the B2 still the better option?"
    },
    {
        "start_time": 1052.4,
        "text": " Well, there are some advantages of compelling circumstances that's only available if your"
    },
    {
        "start_time": 1058.08,
        "text": " I-140 is approved."
    },
    {
        "start_time": 1060.3,
        "text": " There are some disadvantages of compelling circumstances."
    },
    {
        "start_time": 1063.9,
        "text": " For a compelling circumstances is that yes, you can get an employment authorization,"
    },
    {
        "start_time": 1069.5,
        "text": " but you must have some compelling reasons."
    },
    {
        "start_time": 1071.66,
        "text": " So especially if your children are going to school in between or you have some medical"
    },
    {
        "start_time": 1076.62,
        "text": " other issues or you have a mortgage that you need to pay."
    },
    {
        "start_time": 1080.1,
        "text": " They can be compelling circumstances."
    },
    {
        "start_time": 1081.94,
        "text": " We have got the approvals of the compelling circumstances, the idea of the circumstances."
    },
    {
        "start_time": 1087.2,
        "text": " The only problem with compelling circumstances is that once you cross the 60 days of the"
    },
    {
        "start_time": 1092.8,
        "text": " grace period, if you want to convert back into H-140, you cannot convert back into H-140."
    },
    {
        "start_time": 1099.8,
        "text": " You will have to go outside the country since your stamp might have already been expired."
    },
    {
        "start_time": 1104.0,
        "text": " You have to get the stamping to come back into the country."
    },
    {
        "start_time": 1107.56,
        "text": " That is a big minus point for the compelling circumstances."
    },
    {
        "start_time": 1110.88,
        "text": " The advantage of compelling circumstances EAD is of course you are going to get an EAD"
    },
    {
        "start_time": 1115.98,
        "text": " which allows you to work."
    },
    {
        "start_time": 1117.98,
        "text": " Coupling circumstances EAD also allows the dependent also to get a work permit to work"
    },
    {
        "start_time": 1122.46,
        "text": " in the United States, but it's only valid for one year under extreme circumstances."
    },
    {
        "start_time": 1127.86,
        "text": " It could be excellent for one more year, but generally it is only approved for one year"
    },
    {
        "start_time": 1133.3,
        "text": " and you want to change it back to H-140."
    },
    {
        "start_time": 1135.74,
        "text": " You may have a big trouble."
    },
    {
        "start_time": 1136.94,
        "text": " You will have to go outside the country to get the stamping."
    },
    {
        "start_time": 1139.66,
        "text": " A couple of questions on that."
    },
    {
        "start_time": 1142.34,
        "text": " One from Tejas."
    },
    {
        "start_time": 1143.34,
        "text": " He says, what happens to the dependence on H-4 if we change status to the B-2?"
    },
    {
        "start_time": 1149.28,
        "text": " You need to also file a change of status for your dependence so that they will also switch"
    },
    {
        "start_time": 1153.68,
        "text": " to B-2."
    },
    {
        "start_time": 1154.68,
        "text": " They cannot remain on H-4 if you're no longer in H-1 status."
    },
    {
        "start_time": 1158.8,
        "text": " Then Sandeep wants to know if I switch from H-1 to B-2, can my spouse continue working"
    },
    {
        "start_time": 1164.24,
        "text": " on the H-4 EAD?"
    },
    {
        "start_time": 1166.12,
        "text": " No."
    },
    {
        "start_time": 1167.24,
        "text": " Your spouse will also need to convert to B-2 and then because you're no longer in H-1"
    },
    {
        "start_time": 1172.14,
        "text": " status, your spouse is no longer in H-4 status."
    },
    {
        "start_time": 1175.3,
        "text": " It means that EAD is not valid at that moment."
    },
    {
        "start_time": 1178.46,
        "text": " Even though it's not expired, you can bring it back to life by her converting back to"
    },
    {
        "start_time": 1183.9,
        "text": " H-4 in the future and still use that same card if it's not expired, but she can't take"
    },
    {
        "start_time": 1188.9,
        "text": " advantage and use it if she's not actually in H-4 status, which she wouldn't be once"
    },
    {
        "start_time": 1194.22,
        "text": " you both convert to B-2."
    },
    {
        "start_time": 1197.84,
        "text": " Last topic we wanted to discuss is this I-94 expiring early due to the passport."
    },
    {
        "start_time": 1205.32,
        "text": " How do we fix it?"
    },
    {
        "start_time": 1206.84,
        "text": " This happens most commonly."
    },
    {
        "start_time": 1209.76,
        "text": " You came into the U.S. You have your valid passport."
    },
    {
        "start_time": 1213.52,
        "text": " You have your valid visa."
    },
    {
        "start_time": 1215.36,
        "text": " You filed an extension with USCIS."
    },
    {
        "start_time": 1217.72,
        "text": " You got that approved."
    },
    {
        "start_time": 1218.72,
        "text": " Now you have a new I-797 approval notice that's extending for another three years."
    },
    {
        "start_time": 1226.5,
        "text": " Then at some point you travel again and you get the visa stamp or maybe you use the same"
    },
    {
        "start_time": 1233.9,
        "text": " visa stamp, but now your passport is expiring before your new I-797 approval expires."
    },
    {
        "start_time": 1240.66,
        "text": " When you're filing the extension, that's totally fine."
    },
    {
        "start_time": 1243.58,
        "text": " They will give you the I-94 till the date you've requested the full three years, but"
    },
    {
        "start_time": 1248.26,
        "text": " when you're coming into the U.S. with an expiring passport, they're only going to give you the"
    },
    {
        "start_time": 1252.86,
        "text": " I-94 till the date that your passport is expiring, even though you have an I-797 approval notice"
    },
    {
        "start_time": 1259.36,
        "text": " with an I-94 on it that's valid for a longer period of time."
    },
    {
        "start_time": 1263.28,
        "text": " You have to go by the one that you got most recently at the port of entry."
    },
    {
        "start_time": 1268.64,
        "text": " That's the one that controls."
    },
    {
        "start_time": 1270.6,
        "text": " Now your status ends earlier."
    },
    {
        "start_time": 1273.48,
        "text": " If you are aware of this and figure it out before that I-94 expires, before your passport"
    },
    {
        "start_time": 1282.34,
        "text": " expires, then you get your new passport."
    },
    {
        "start_time": 1286.62,
        "text": " You can either travel again and when you come back, your I-94 will be issued now till the"
    },
    {
        "start_time": 1292.02,
        "text": " end date of your I-797 because you have a valid passport through that date."
    },
    {
        "start_time": 1297.5,
        "text": " Or you can file an extension with USCIS to get the extension that you were already granted."
    },
    {
        "start_time": 1303.74,
        "text": " Most people, I would say, travel in that situation."
    },
    {
        "start_time": 1307.28,
        "text": " The issue is when you find out about it after the passport expires, after the I-94 expires,"
    },
    {
        "start_time": 1316.52,
        "text": " a lot of people think they can go to deferred inspection, which is the CBP office, usually"
    },
    {
        "start_time": 1323.36,
        "text": " near the airport, and ask CBP to fix it because now you've gotten your passport extended."
    },
    {
        "start_time": 1330.88,
        "text": " We definitely do not recommend that."
    },
    {
        "start_time": 1335.06,
        "text": " The CBP will say this was not an error."
    },
    {
        "start_time": 1338.06,
        "text": " The date they gave you was the correct date and now you've overstayed that date."
    },
    {
        "start_time": 1342.5,
        "text": " We might just want to deport you."
    },
    {
        "start_time": 1345.38,
        "text": " It is a very dangerous situation to walk into a CBP deferred inspection office with an expired"
    },
    {
        "start_time": 1351.66,
        "text": " I-94, even if it was due to your passport expiring."
    },
    {
        "start_time": 1357.38,
        "text": " We definitely would not recommend that."
    },
    {
        "start_time": 1359.94,
        "text": " What options do people have if the I-94 is already expired, if they can't go to deferred"
    },
    {
        "start_time": 1364.6,
        "text": " inspection, should they travel, should they file an extension?"
    },
    {
        "start_time": 1368.2,
        "text": " There is a certain gray area in this though."
    },
    {
        "start_time": 1372.88,
        "text": " I would definitely want people to contact one-on-one."
    },
    {
        "start_time": 1376.4,
        "text": " Sometimes it is not good to contact your company lawyer though."
    },
    {
        "start_time": 1381.72,
        "text": " The reason why you should not contact a company lawyer is that the company lawyer, the company"
    },
    {
        "start_time": 1387.04,
        "text": " can just terminate your employment because they may not consider that you are maintaining"
    },
    {
        "start_time": 1392.22,
        "text": " the status and they don't want to get involved in this stuff."
    },
    {
        "start_time": 1395.66,
        "text": " There are some steps that are involved where you travel outside the country and coming"
    },
    {
        "start_time": 1400.82,
        "text": " back that you can discuss with an immigration lawyer privately that you can step outside"
    },
    {
        "start_time": 1408.58,
        "text": " the country and come back in, but you need to discuss that with an immigration lawyer"
    },
    {
        "start_time": 1412.22,
        "text": " that can be easily fixed."
    },
    {
        "start_time": 1414.1,
        "text": " CBP, no, company HR or company lawyer, no, a private lawyer would be much better for"
    },
    {
        "start_time": 1421.4,
        "text": " you to contact rather than directly contacting CBP, especially we had a lot of bad experiences"
    },
    {
        "start_time": 1428.4,
        "text": " in Dallas."
    },
    {
        "start_time": 1429.4,
        "text": " Anything else, Kambi?"
    },
    {
        "start_time": 1432.4,
        "text": " Before we go to questions."
    },
    {
        "start_time": 1434.4,
        "text": " So questions."
    },
    {
        "start_time": 1435.4,
        "text": " Srinidhi says, can we travel to India when the H-4 EAD is in process?"
    },
    {
        "start_time": 1441.4,
        "text": " I received the approval for the H-1 and H-4 back in October and how long does the EAD"
    },
    {
        "start_time": 1447.4,
        "text": " approval take?"
    },
    {
        "start_time": 1448.7,
        "text": " Yes, so if you have the H-4 and you're just waiting for the EAD, you can travel."
    },
    {
        "start_time": 1456.22,
        "text": " It will not impact the EAD."
    },
    {
        "start_time": 1458.1,
        "text": " The H-4 EAD application just requires you to be physically present in the U.S. in H-4"
    },
    {
        "start_time": 1463.86,
        "text": " status on the day of filing, but once it's filed, you can exit the U.S. and it will not"
    },
    {
        "start_time": 1469.3,
        "text": " impact the pending H-4 EAD application."
    },
    {
        "start_time": 1473.34,
        "text": " Processing times are all over the board, I would say anywhere from four to eight months"
    },
    {
        "start_time": 1477.4,
        "text": " right now could be getting longer as we saw during the previous Trump administration."
    },
    {
        "start_time": 1483.4,
        "text": " Sambhi has this question that both he and his wife are green card holders."
    },
    {
        "start_time": 1489.4,
        "text": " When to India, he came back in March."
    },
    {
        "start_time": 1491.4,
        "text": " His wife is coming back in June."
    },
    {
        "start_time": 1493.4,
        "text": " The CBP of us is saying that five months is too close."
    },
    {
        "start_time": 1497.4,
        "text": " I can't get the question."
    },
    {
        "start_time": 1499.4,
        "text": " The one thing I will tell you, Sambhi is, if your wife is traveling to India,"
    },
    {
        "start_time": 1507.4,
        "text": " and she's coming back after six months, it's a big no-no unless you get a re-entry permit though."
    },
    {
        "start_time": 1515.4,
        "text": " People are asking, can they cancel the green card? Absolutely they can."
    },
    {
        "start_time": 1521.4,
        "text": " You're seeing that happening though."
    },
    {
        "start_time": 1523.4,
        "text": " If it is more than 180 days that you're traveling outside the country, you better speak with an"
    },
    {
        "start_time": 1529.4,
        "text": " immigration lawyer without speaking with an immigration lawyer."
    },
    {
        "start_time": 1532.5,
        "text": " You don't embark on a journey of going outside the country on a green card for more than six months."
    },
    {
        "start_time": 1539.5,
        "text": " Ajay Yadav from Facebook has this question, does the GC holders also need to register?"
    },
    {
        "start_time": 1547.5,
        "text": " No, and yes, most of the GC holders definitely don't need to register."
    },
    {
        "start_time": 1554.5,
        "text": " They're fine."
    },
    {
        "start_time": 1555.5,
        "text": " But there is one class of GC holders."
    },
    {
        "start_time": 1557.6,
        "text": " It's not registration exactly."
    },
    {
        "start_time": 1559.6,
        "text": " If you have turned above 14 though, you need to renew the green card by filing an application called I90 form."
    },
    {
        "start_time": 1569.6,
        "text": " You can do it online."
    },
    {
        "start_time": 1571.6,
        "text": " You don't need a lawyer or anything like that."
    },
    {
        "start_time": 1573.6,
        "text": " But turning above because they need these people to have a bio-metrics done."
    },
    {
        "start_time": 1578.6,
        "text": " That need to be done."
    },
    {
        "start_time": 1580.7,
        "text": " Kishore Bandari from Facebook has this question, does the US children who are American citizens"
    },
    {
        "start_time": 1589.7,
        "text": " they need to do any registration or bio-metrics?"
    },
    {
        "start_time": 1592.7,
        "text": " No, they don't need to do anything."
    },
    {
        "start_time": 1594.7,
        "text": " They don't need to come to this."
    },
    {
        "start_time": 1596.7,
        "text": " They don't come under this YouTube channel guys."
    },
    {
        "start_time": 1600.7,
        "text": " The American citizens, they don't come in to this one."
    },
    {
        "start_time": 1604.7,
        "text": " This is not for you."
    },
    {
        "start_time": 1605.7,
        "text": " Anything what we are telling here is not applicable to US citizens."
    },
    {
        "start_time": 1610.7,
        "text": " Sanctosh says my wife is on H4 and about to join a master's program this fall in August."
    },
    {
        "start_time": 1618.7,
        "text": " And wants to know how long it will take to convert to F1 and is it quicker to step out of the country and get F1 stamping."
    },
    {
        "start_time": 1625.7,
        "text": " Well, remember you do have premium processing."
    },
    {
        "start_time": 1627.7,
        "text": " So with premium processing, it takes 30 business days to get the change of status from H4 to F1."
    },
    {
        "start_time": 1635.8,
        "text": " Right now, we would not recommend travel."
    },
    {
        "start_time": 1638.8,
        "text": " We would not recommend going for stamping."
    },
    {
        "start_time": 1640.8,
        "text": " There is no guarantees that she would get the stamp and be able to come back."
    },
    {
        "start_time": 1644.8,
        "text": " There might be a travel ban by the time she's trying to come back."
    },
    {
        "start_time": 1648.8,
        "text": " So that's a big risk when you have the option of filing with USCIS."
    },
    {
        "start_time": 1658.8,
        "text": " We recently came into United States and Chicago Airport."
    },
    {
        "start_time": 1662.9,
        "text": " We are not going to be able to do fingerprinting, but the I-94 is reflected perfectly."
    },
    {
        "start_time": 1668.9,
        "text": " Is there something to be worried?"
    },
    {
        "start_time": 1670.9,
        "text": " Absolutely not."
    },
    {
        "start_time": 1671.9,
        "text": " Right now, they're doing eye scanning that is supplementing the biometrics in most of the places."
    },
    {
        "start_time": 1678.9,
        "text": " Though if the I-94 is reflecting properly, you do not have to worry about it at all."
    },
    {
        "start_time": 1685.0,
        "text": " Manish says, current status is H1B, planning to switch to H4EAD, along with premium processing."
    },
    {
        "start_time": 1693.0,
        "text": " How long does it take for the approvals?"
    },
    {
        "start_time": 1695.0,
        "text": " I would like to avoid an employment gap when switching from H1B to H4EAD."
    },
    {
        "start_time": 1701.0,
        "text": " Well, there is no premium processing."
    },
    {
        "start_time": 1703.0,
        "text": " There used to be up until January 2025, where you could file the H1B extension and premium"
    },
    {
        "start_time": 1710.1,
        "text": " and include the H4 and H4EAD, and they would approve all of them together in premium processing."
    },
    {
        "start_time": 1717.1,
        "text": " The settlement agreement, that was based on a court settlement that expired in January."
    },
    {
        "start_time": 1722.1,
        "text": " So USCIS is no longer processing the H4 and H4EAD in premium processing."
    },
    {
        "start_time": 1728.1,
        "text": " So yeah, there could be a gap."
    },
    {
        "start_time": 1730.1,
        "text": " You really had to make sure that there's enough time left on your H1B status to get the H4 and H4EAD approved."
    },
    {
        "start_time": 1738.2,
        "text": " Right now, it could take four to eight months."
    },
    {
        "start_time": 1741.2,
        "text": " I don't know what it would be by the time you're ready to file, but unfortunately there's no premium processing there."
    },
    {
        "start_time": 1747.2,
        "text": " Is change of status available, premium processing available from F1 to H4 and H4EAD?"
    },
    {
        "start_time": 1753.2,
        "text": " I have an I-14 to approve."
    },
    {
        "start_time": 1755.2,
        "text": " Unfortunately, no."
    },
    {
        "start_time": 1756.2,
        "text": " It's not available at this point of time."
    },
    {
        "start_time": 1761.2,
        "text": " Don't worry about it as the question."
    },
    {
        "start_time": 1764.3,
        "text": " My child has aged out on the employment-based integration."
    },
    {
        "start_time": 1768.3,
        "text": " Is there any other way other than F2B, which is backlog significantly and it's been stuck there for four years."
    },
    {
        "start_time": 1778.3,
        "text": " Unfortunately for F2B aged out kids, that's the only thing that you can get the green card."
    },
    {
        "start_time": 1785.3,
        "text": " Obviously, they can convert into first employment-based category when you become a U.S. citizen."
    },
    {
        "start_time": 1791.4,
        "text": " But sometimes F2B is much faster than first category though in the family-based immigration."
    },
    {
        "start_time": 1803.4,
        "text": " Kavita says, can we apply for a B2 visitor visa extension at this time?"
    },
    {
        "start_time": 1808.4,
        "text": " And if the extension is denied, will they issue an NTA or a notice to appear in immigration court?"
    },
    {
        "start_time": 1815.5,
        "text": " You can file an extension as long as it's filed before the current I-94 expires or if the first B2 is still pending,"
    },
    {
        "start_time": 1824.5,
        "text": " you need to make sure it's filed before the end date that you requested in that first B2."
    },
    {
        "start_time": 1829.5,
        "text": " You definitely need to make sure that the activities that you're planning on doing are in line with B2 visitor visa status."
    },
    {
        "start_time": 1838.5,
        "text": " You may want to submit proof that you have a residence abroad that you intend to return to."
    },
    {
        "start_time": 1843.6,
        "text": " Maybe plane tickets for the return trip so they can see that you're actually planning on leaving financial documents"
    },
    {
        "start_time": 1851.6,
        "text": " to show that you can support yourself for that extended period of time."
    },
    {
        "start_time": 1855.6,
        "text": " There is a new policy out that says that if at the time of a denial of an immigration application by USCIS,"
    },
    {
        "start_time": 1864.6,
        "text": " if you are then unlawfully present, meaning your I-94 has expired, they can issue an NTA."
    },
    {
        "start_time": 1872.7,
        "text": " Now we had that same policy before under the first Trump administration."
    },
    {
        "start_time": 1876.7,
        "text": " We never saw it enforced for employment-based applicants."
    },
    {
        "start_time": 1881.7,
        "text": " I don't think I've ever seen it enforced for a B2 extension denial."
    },
    {
        "start_time": 1885.7,
        "text": " But there is some risk."
    },
    {
        "start_time": 1887.7,
        "text": " Things are different this time around with Trump."
    },
    {
        "start_time": 1890.7,
        "text": " They're definitely moving things much faster and being even more strict on everything immigration."
    },
    {
        "start_time": 1899.8,
        "text": " So there is a possibility of that but we've not seen that happen in the past."
    },
    {
        "start_time": 1903.8,
        "text": " Sam from YouTube has this question."
    },
    {
        "start_time": 1906.8,
        "text": " My kids went through the biometric process in 2018."
    },
    {
        "start_time": 1910.8,
        "text": " It was Trump arrived those time."
    },
    {
        "start_time": 1912.8,
        "text": " They did biometrics even for one year old kid too."
    },
    {
        "start_time": 1915.8,
        "text": " On the H4, do they still need to register?"
    },
    {
        "start_time": 1918.8,
        "text": " One advice that I have is that if they are able turn 14 though, I want them to be registered."
    },
    {
        "start_time": 1926.8,
        "text": " Simple."
    },
    {
        "start_time": 1927.9,
        "text": " If they came into United States when they are above 15 and they got the biometrics done in India,"
    },
    {
        "start_time": 1935.9,
        "text": " they don't need to."
    },
    {
        "start_time": 1936.9,
        "text": " But if they came into United States in turn 18, it's a doubtful thing because their biometrics has already done."
    },
    {
        "start_time": 1943.9,
        "text": " I want them to be registered."
    },
    {
        "start_time": 1945.9,
        "text": " That's a better way."
    },
    {
        "start_time": 1947.9,
        "text": " Ashish Kutla, my son entered on H4 when he was 12 years old."
    },
    {
        "start_time": 1951.9,
        "text": " Now he's 15."
    },
    {
        "start_time": 1952.9,
        "text": " Do I need to register himself?"
    },
    {
        "start_time": 1954.9,
        "text": " Absolutely you need to."
    },
    {
        "start_time": 1957.0,
        "text": " Colleen wants to know whenever I switch jobs, do I need to transfer the I-140 to the new employer every time?"
    },
    {
        "start_time": 1968.0,
        "text": " Not necessarily."
    },
    {
        "start_time": 1970.0,
        "text": " You really need to look at the priority date of that I-140 and when it may become current."
    },
    {
        "start_time": 1978.0,
        "text": " For people that are stuck in the backlog, may take years and years for the date to become current,"
    },
    {
        "start_time": 1985.1,
        "text": " you may change jobs 3, 4, 5 times before the date is current."
    },
    {
        "start_time": 1989.1,
        "text": " You don't have to have an I-140 with every single one of those employers."
    },
    {
        "start_time": 1993.1,
        "text": " You can use the old employer's I-140 to keep extending your H-1B status to transfer to new employer A, employer B, employer C down the line."
    },
    {
        "start_time": 2002.1,
        "text": " That old I-140 remains valid to allow you to do that."
    },
    {
        "start_time": 2006.1,
        "text": " But when your date is becoming current, that's when you need to have the new I-140 in place with that new employer."
    },
    {
        "start_time": 2012.2,
        "text": " Question with regards to NPT, it's called non-protuncto."
    },
    {
        "start_time": 2017.2,
        "text": " When the I-94 expires, can the USCIS issue NPT retroactively?"
    },
    {
        "start_time": 2024.2,
        "text": " Can they excuse retroactively?"
    },
    {
        "start_time": 2026.2,
        "text": " This question comes from Ganesh Kashyam."
    },
    {
        "start_time": 2028.2,
        "text": " The answer is yes, they can."
    },
    {
        "start_time": 2032.2,
        "text": " But there might be other better ways."
    },
    {
        "start_time": 2034.2,
        "text": " If you have the I-797 which is still valid, there might be other better ways of traveling outside the country."
    },
    {
        "start_time": 2041.3,
        "text": " Instead of using the NPT."
    },
    {
        "start_time": 2043.3,
        "text": " If the NPT is successful, non-protuncto is what we call it as."
    },
    {
        "start_time": 2046.3,
        "text": " NPT is successful, absolutely you're in much better position."
    },
    {
        "start_time": 2050.3,
        "text": " But if the NPT fails, so you may be in the worst situation that you could possibly imagine."
    },
    {
        "start_time": 2056.3,
        "text": " That's the reason non-protunct or NPT sometimes is may become an asset, but it may become a big liability if you get the denial."
    },
    {
        "start_time": 2066.4,
        "text": " Now, in the previous administration, yes, under the certain circumstances we could judge that non-protuncto was a routine thing to get an approval."
    },
    {
        "start_time": 2076.4,
        "text": " But we don't know under the new administration how they're going to behave."
    },
    {
        "start_time": 2079.5,
        "text": " Herein has an EB2 EAD AP on H1B and wants to know if he travels and comes back using the AP, will this indicate that he's now using his EAD and losing his H1 status?"
    },
    {
        "start_time": 2097.5,
        "text": " And then if he starts using the EAD, can he do multiple jobs?"
    },
    {
        "start_time": 2102.6,
        "text": " So coming in on AP, you have a choice."
    },
    {
        "start_time": 2106.6,
        "text": " You can choose to use the EAD or if you are still working for the H1B employer, your H1B has not expired."
    },
    {
        "start_time": 2113.6,
        "text": " You're under the same terms and conditions that your H1B petition was filed for."
    },
    {
        "start_time": 2117.6,
        "text": " You can consider yourself to be an H1B status."
    },
    {
        "start_time": 2120.6,
        "text": " You can extend your H1B, you can transfer your H1B, you can change status just like you could before."
    },
    {
        "start_time": 2125.6,
        "text": " So entering on AP does not make you lose your H1 status."
    },
    {
        "start_time": 2129.7,
        "text": " It doesn't require you to use the EAD."
    },
    {
        "start_time": 2132.7,
        "text": " But if you do use the EAD, yes, you can do multiple jobs."
    },
    {
        "start_time": 2137.7,
        "text": " You need to of course always have a job that supports the pending green card."
    },
    {
        "start_time": 2141.7,
        "text": " So that's either the job with the company that sponsored you initially, or if you're using AC21, it has to be a job that's same or similar occupation as the one that you were originally sponsored for."
    },
    {
        "start_time": 2153.7,
        "text": " But you can also do side jobs without any issues."
    },
    {
        "start_time": 2156.8,
        "text": " They can be full time, part time."
    },
    {
        "start_time": 2158.8,
        "text": " Just make sure you keep good documentation of the work you're doing."
    },
    {
        "start_time": 2162.8,
        "text": " Have all of your W2s."
    },
    {
        "start_time": 2164.8,
        "text": " We've seen a number of times, especially during the previous Trump administration where I485 interviews were required for everyone."
    },
    {
        "start_time": 2173.8,
        "text": " These immigration officers acted shocked that someone could work more than one job."
    },
    {
        "start_time": 2179.9,
        "text": " If you showed up with multiple W2s, they got so confused and sent RFEs and just had a very long interview."
    },
    {
        "start_time": 2188.9,
        "text": " So yes, you can do it, but just be prepared for how to deal with it when you get an interview, if you're calling for an interview."
    },
    {
        "start_time": 2196.9,
        "text": " Facebook has this question."
    },
    {
        "start_time": 2198.9,
        "text": " He is on H1B, is also on NIW adjustment of status."
    },
    {
        "start_time": 2204.9,
        "text": " He lost his job."
    },
    {
        "start_time": 2207.0,
        "text": " I'm not sure if he has, yeah, he's an adjustment of status."
    },
    {
        "start_time": 2213.0,
        "text": " He lost his job."
    },
    {
        "start_time": 2215.0,
        "text": " If you lose the job on H1B, you have a 60 day grace period."
    },
    {
        "start_time": 2219.0,
        "text": " But if you lose a job on the adjustment of status, you may not have the 60 day grace period."
    },
    {
        "start_time": 2225.0,
        "text": " We definitely want you to contact an immigration lawyer."
    },
    {
        "start_time": 2228.0,
        "text": " Self-employment is something that you can take a look into."
    },
    {
        "start_time": 2231.1,
        "text": " Considered into definitely you cannot move into B2."
    },
    {
        "start_time": 2237.1,
        "text": " That's not advisable because you're giving up the entire 48 application."
    },
    {
        "start_time": 2241.1,
        "text": " We definitely want you to contact an immigration lawyer immediately."
    },
    {
        "start_time": 2248.1,
        "text": " Babu says I'm currently in F1 status."
    },
    {
        "start_time": 2251.1,
        "text": " I changed status from H1B due to maxing out of the six year limit."
    },
    {
        "start_time": 2256.2,
        "text": " Can I apply for a new H1 in the current year?"
    },
    {
        "start_time": 2259.2,
        "text": " Or do I need to leave the country for at least one year?"
    },
    {
        "start_time": 2262.2,
        "text": " To reset the six year limit, you have to be outside the country for one full year before you can qualify."
    },
    {
        "start_time": 2269.2,
        "text": " So even if you go through the lottery, you've already maxed out your six year limit."
    },
    {
        "start_time": 2274.2,
        "text": " That doesn't help you in any way."
    },
    {
        "start_time": 2276.2,
        "text": " You won't get that H1B unless you have an approved I-140 or labor certification pending for more than a year."
    },
    {
        "start_time": 2284.3,
        "text": " So yeah, you'd have to go outside the country for a full year before you can reset the contract."
    },
    {
        "start_time": 2289.3,
        "text": " I want your attention."
    },
    {
        "start_time": 2290.3,
        "text": " One of the comments made by Sambhi though."
    },
    {
        "start_time": 2293.3,
        "text": " Public benefits announcement."
    },
    {
        "start_time": 2296.3,
        "text": " He's a GC holder at the Port of Entry."
    },
    {
        "start_time": 2300.3,
        "text": " They have asked him very tough questions."
    },
    {
        "start_time": 2304.3,
        "text": " They were very rude."
    },
    {
        "start_time": 2305.3,
        "text": " Their tone was very bad."
    },
    {
        "start_time": 2307.4,
        "text": " One thing I advise people is if you can try to make sure you note down the name of the officer."
    },
    {
        "start_time": 2315.4,
        "text": " There is a place in the CBP website that you can complain against the officer."
    },
    {
        "start_time": 2321.4,
        "text": " We definitely want you to complain."
    },
    {
        "start_time": 2323.4,
        "text": " I know in this Trump administration, maybe we may get some relief."
    },
    {
        "start_time": 2328.4,
        "text": " We may not get some relief."
    },
    {
        "start_time": 2330.4,
        "text": " But what if the same officer, a lot of people have complained against that guy?"
    },
    {
        "start_time": 2334.5,
        "text": " So there could be some action on that bill."
    },
    {
        "start_time": 2337.5,
        "text": " Yes, we have."
    },
    {
        "start_time": 2340.5,
        "text": " Have you seen generally Emily, the officer becoming more rude in this new administration?"
    },
    {
        "start_time": 2348.5,
        "text": " Yeah, I mean, I feel like it started almost immediately after the election."
    },
    {
        "start_time": 2353.5,
        "text": " Just the tone changed with consular officers and CBP officers."
    },
    {
        "start_time": 2358.6,
        "text": " I think in the past it was you should admit as many people as possible as long as they're in compliance and following the law."
    },
    {
        "start_time": 2367.6,
        "text": " Now it's you should admit as few people as possible."
    },
    {
        "start_time": 2370.6,
        "text": " If you have any possible reason you could deny, go ahead and deny entry."
    },
    {
        "start_time": 2374.6,
        "text": " So yeah, I definitely heard of more and more issues than before."
    },
    {
        "start_time": 2379.6,
        "text": " Money is too much."
    },
    {
        "start_time": 2381.6,
        "text": " It's a very interesting question."
    },
    {
        "start_time": 2383.6,
        "text": " I see it very often though."
    },
    {
        "start_time": 2385.7,
        "text": " I have only two and a half years left on H1B."
    },
    {
        "start_time": 2388.7,
        "text": " Is the H4EAD better for me?"
    },
    {
        "start_time": 2391.7,
        "text": " Or is H1B better?"
    },
    {
        "start_time": 2393.7,
        "text": " Absolutely H4EAD is better for you right now."
    },
    {
        "start_time": 2396.7,
        "text": " The reason is that if you don't have a labor approval though, save the H1B."
    },
    {
        "start_time": 2401.7,
        "text": " Be an H4EAD."
    },
    {
        "start_time": 2403.7,
        "text": " One good thing is that on H4EAD, you can apply the labor."
    },
    {
        "start_time": 2407.7,
        "text": " You can apply the I-140 and respect back your H1B and then get perfect H1B once the labor and I-140."
    },
    {
        "start_time": 2415.7,
        "text": " So definitely saving the H1B period as much as possible is in your best interest right now."
    },
    {
        "start_time": 2425.7,
        "text": " So Roth says that H1, H4 and H4EAD are being filed altogether in premium."
    },
    {
        "start_time": 2431.7,
        "text": " Current visa stamp expires August 2025 and we're planning for a cruise to the Bahamas in April 2025."
    },
    {
        "start_time": 2438.7,
        "text": " Is it still fine to travel?"
    },
    {
        "start_time": 2440.8,
        "text": " Because you have a valid visa stamp, you should not have any issues with traveling for a cruise."
    },
    {
        "start_time": 2446.8,
        "text": " You want to either get the approvals of all of those applications before you leave"
    },
    {
        "start_time": 2453.8,
        "text": " or go on the cruise first, come back and then file all of the renewals."
    },
    {
        "start_time": 2458.8,
        "text": " And the reason for that is when you come back, you are going to be issued a different I-94 number based on that new entry."
    },
    {
        "start_time": 2467.9,
        "text": " And so if you have the application pending while you leave and come back,"
    },
    {
        "start_time": 2472.9,
        "text": " your approval is going to be issued with the old I-94 number, not the new I-94 number."
    },
    {
        "start_time": 2477.9,
        "text": " And that can create a mismatch in there."
    },
    {
        "start_time": 2479.9,
        "text": " All these government databases that talk to each other."
    },
    {
        "start_time": 2482.9,
        "text": " Most of the time the problem comes in with driver's license renewals."
    },
    {
        "start_time": 2486.9,
        "text": " Or sometimes if you have changed jobs and you're going through the e-verify process with the new employer,"
    },
    {
        "start_time": 2492.9,
        "text": " sometimes the records don't all match up."
    },
    {
        "start_time": 2496.0,
        "text": " So that's generally I recommend not to travel while the applications are pending."
    },
    {
        "start_time": 2501.0,
        "text": " Does unemployment benefits affect the NIW 485 application?"
    },
    {
        "start_time": 2506.0,
        "text": " I didn't understand what the unemployment benefits are."
    },
    {
        "start_time": 2509.0,
        "text": " Are you speaking of some of the government benefits?"
    },
    {
        "start_time": 2511.0,
        "text": " Yes, definitely. That will affect your 485 application."
    },
    {
        "start_time": 2514.0,
        "text": " If you're speaking about, let's say for example, you got laid off from company A, you moved to company B."
    },
    {
        "start_time": 2520.0,
        "text": " And you know, the companies give some, you know, 60-day extra payment and certain other things."
    },
    {
        "start_time": 2525.1,
        "text": " That's perfectly all right."
    },
    {
        "start_time": 2527.1,
        "text": " It's not going to affect your green card."
    },
    {
        "start_time": 2529.1,
        "text": " But if it's a government benefit, you definitely may affect your green card."
    },
    {
        "start_time": 2538.1,
        "text": " Anusha says my priority date is March 2013."
    },
    {
        "start_time": 2541.1,
        "text": " Originally filed in EB3, then interfiled to EB2."
    },
    {
        "start_time": 2545.1,
        "text": " Now my date is current in EB3."
    },
    {
        "start_time": 2547.1,
        "text": " Do I need to file another interfiled to EB3?"
    },
    {
        "start_time": 2551.1,
        "text": " Yeah, I think I would do the transfer of underlying basis."
    },
    {
        "start_time": 2554.2,
        "text": " It's a great way to get their attention and let them know, hey, my date is current."
    },
    {
        "start_time": 2558.2,
        "text": " Hurry up and approve my case while green cards are available in EB3."
    },
    {
        "start_time": 2562.2,
        "text": " So they will not, well, I can't say they won't automatically do it."
    },
    {
        "start_time": 2566.2,
        "text": " They're not supposed to automatically do it in EB3 when you have both."
    },
    {
        "start_time": 2570.2,
        "text": " But we did see a lot of that after the March 2020 filings where they would just kind of automatically do it."
    },
    {
        "start_time": 2577.3,
        "text": " One second."
    },
    {
        "start_time": 2579.3,
        "text": " If I get promoted, is amendment required?"
    },
    {
        "start_time": 2583.3,
        "text": " The main, this question is coming from Suraj Kumar."
    },
    {
        "start_time": 2587.3,
        "text": " It depends on if the promotion involves in job duties, which are significantly different than the previous job."
    },
    {
        "start_time": 2595.3,
        "text": " If it's just minor differences though, then you don't need to apply for a job."
    },
    {
        "start_time": 2601.4,
        "text": " But if there are major differences in the job duties, you definitely need to get the amendment."
    },
    {
        "start_time": 2607.4,
        "text": " What was the word in the effort?"
    },
    {
        "start_time": 2609.4,
        "text": " When the change is significant enough, what's the legal word?"
    },
    {
        "start_time": 2613.4,
        "text": " Material."
    },
    {
        "start_time": 2615.4,
        "text": " Oh, material change."
    },
    {
        "start_time": 2617.4,
        "text": " Jockey says,"
    },
    {
        "start_time": 2621.4,
        "text": " Jockey is a major job."
    },
    {
        "start_time": 2623.5,
        "text": " Material change."
    },
    {
        "start_time": 2625.5,
        "text": " Jockey says,"
    },
    {
        "start_time": 2631.5,
        "text": " My five years of my H1B has been used and so I filed for a sixth year H1B extension in regular process."
    },
    {
        "start_time": 2638.5,
        "text": " My previous H1B has already expired and so I'm here based on the receipt notice."
    },
    {
        "start_time": 2644.5,
        "text": " What are my options if something happens?"
    },
    {
        "start_time": 2646.6,
        "text": " This would have been a better question to ask before your previous H1B expired because you could have filed a transfer to another company as a backup."
    },
    {
        "start_time": 2658.6,
        "text": " You could have filed a change of status to B2 as a backup."
    },
    {
        "start_time": 2662.6,
        "text": " Lots of more options, but once your previous I-94 expired, you're technically no longer in H1B status."
    },
    {
        "start_time": 2670.7,
        "text": " You're currently in what we call a period of stay authorized by the attorney general or POSA bag."
    },
    {
        "start_time": 2676.7,
        "text": " That is lawful status that does allow you to work so everything's fine there."
    },
    {
        "start_time": 2682.7,
        "text": " But because you're in POSA bag, not H1B, POSA bag is not exactly a non-immigrant status."
    },
    {
        "start_time": 2690.7,
        "text": " That means you can't change status from being in POSA bag."
    },
    {
        "start_time": 2693.7,
        "text": " You can't extend status from being in POSA bag."
    },
    {
        "start_time": 2696.8,
        "text": " You would have had to file something before your previous H1B expired."
    },
    {
        "start_time": 2701.8,
        "text": " So what happens if the H1B gets denied after your I-94 has expired?"
    },
    {
        "start_time": 2707.8,
        "text": " You may need to exit the U.S. and have your employer file again request consular processing."
    },
    {
        "start_time": 2715.8,
        "text": " And then once it's approved, get the visa stamped and come back into the U.S."
    },
    {
        "start_time": 2719.9,
        "text": " Or exit the U.S. if you qualify for H4 or F1 or whatever other status you might want to do."
    },
    {
        "start_time": 2726.9,
        "text": " That may be your only option because if your denial happens after your I-94 has expired,"
    },
    {
        "start_time": 2735.9,
        "text": " you are automatically out of status from the day after the denial"
    },
    {
        "start_time": 2739.9,
        "text": " and you're accruing unlawful presence from the day after the denial."
    },
    {
        "start_time": 2743.9,
        "text": " That's automatic."
    },
    {
        "start_time": 2745.0,
        "text": " And so you cannot change status or file anything when you are unlawfully present."
    },
    {
        "start_time": 2753.0,
        "text": " They're not going to allow that unless you can make an argument for a nuke protunk, a late filing."
    },
    {
        "start_time": 2758.0,
        "text": " But that's completely up to the discretion of USCIS."
    },
    {
        "start_time": 2762.0,
        "text": " And you've got to have a very good reason for it and probably unexpected denial may not be a great reason nowadays."
    },
    {
        "start_time": 2770.1,
        "text": " That is something we could do in the past with this new administration."
    },
    {
        "start_time": 2775.1,
        "text": " They might not accept many nuke protunks."
    },
    {
        "start_time": 2778.1,
        "text": " Q&A, ADA, martial arts."
    },
    {
        "start_time": 2780.1,
        "text": " I'm on green card."
    },
    {
        "start_time": 2781.1,
        "text": " I have a green card."
    },
    {
        "start_time": 2782.1,
        "text": " I'm traveling to South Korea in May 2035 for a period for a martial arts training for two weeks."
    },
    {
        "start_time": 2789.1,
        "text": " Do I need to worry?"
    },
    {
        "start_time": 2790.1,
        "text": " Absolutely not a problem for your travel at all."
    },
    {
        "start_time": 2794.1,
        "text": " You should not have any problem at all."
    },
    {
        "start_time": 2797.2,
        "text": " Nikhil Gunnala has this question."
    },
    {
        "start_time": 2799.2,
        "text": " My employer filed an EB-2."
    },
    {
        "start_time": 2801.2,
        "text": " My sibling is a US citizen."
    },
    {
        "start_time": 2803.2,
        "text": " Can my sibling file a GC while I'm on H1B?"
    },
    {
        "start_time": 2807.2,
        "text": " They can file something called I-130."
    },
    {
        "start_time": 2810.2,
        "text": " So you'll be standing in line for the green card for the siblings, which is called family fourth preference."
    },
    {
        "start_time": 2817.2,
        "text": " So you can have both EB-2 or EB-3 and also family base two, family base four."
    },
    {
        "start_time": 2824.3,
        "text": " Both are not conflicting."
    },
    {
        "start_time": 2826.3,
        "text": " You can continue with both things."
    },
    {
        "start_time": 2828.3,
        "text": " Absolutely not a problem."
    },
    {
        "start_time": 2833.3,
        "text": " My scope says I have an approved EB-2 I-140 with a 2020 priority date and recently received approval for an EB-1 I-140."
    },
    {
        "start_time": 2842.3,
        "text": " But USCIS did not port my old priority date."
    },
    {
        "start_time": 2846.3,
        "text": " Can I still use that old priority date and file the AOS under the EB-1?"
    },
    {
        "start_time": 2851.4,
        "text": " Technically, yes, but it's very difficult to get that application past the mailroom."
    },
    {
        "start_time": 2858.4,
        "text": " Because they do check to see if the date is current before they will accept your filing."
    },
    {
        "start_time": 2864.4,
        "text": " And if they only look at the EB-1 I-140 approval, they're going to say, oh, this date's not current."
    },
    {
        "start_time": 2869.4,
        "text": " We're going to reject it."
    },
    {
        "start_time": 2871.4,
        "text": " So you may have to submit it multiple times."
    },
    {
        "start_time": 2873.4,
        "text": " You have to put all these bright colored papers and put it in multiple envelopes."
    },
    {
        "start_time": 2877.5,
        "text": " It may be a better option to get that EB-1 I-140 approval fixed before you file the AOS."
    },
    {
        "start_time": 2885.5,
        "text": " You can try an E request."
    },
    {
        "start_time": 2888.5,
        "text": " If this was an EB-1 A where it was a self petition, you can do that yourself and let them know there was a typo in the priority date."
    },
    {
        "start_time": 2895.5,
        "text": " Otherwise, filing, basically refiling the EB-1 as an amendment to port that date would be another option."
    },
    {
        "start_time": 2903.6,
        "text": " The QT has this question."
    },
    {
        "start_time": 2905.6,
        "text": " On I-1984 expiring in July 13, 2025, that's based on the passport."
    },
    {
        "start_time": 2910.6,
        "text": " So most probably my passport's stamping and the 797 probably is expiring way later."
    },
    {
        "start_time": 2918.6,
        "text": " She's asking, what's the right time to get the I-1984 updated?"
    },
    {
        "start_time": 2921.6,
        "text": " Is it 10 days before the expiration date?"
    },
    {
        "start_time": 2924.6,
        "text": " No, it's right now."
    },
    {
        "start_time": 2926.6,
        "text": " Get the passport extended."
    },
    {
        "start_time": 2928.6,
        "text": " That's the first thing that you're going to do."
    },
    {
        "start_time": 2930.7,
        "text": " Just travel to Mexico or travel to India and come back."
    },
    {
        "start_time": 2933.7,
        "text": " There are in this particular circumstances, it's up to you if you want to contact the CBP."
    },
    {
        "start_time": 2938.7,
        "text": " We don't recommend CBP because we had some bad experience in Dallas, a lot of bad experience in Dallas particularly."
    },
    {
        "start_time": 2946.7,
        "text": " But yeah, you can go to Mexico and come back."
    },
    {
        "start_time": 2948.7,
        "text": " Don't wait until 10 days."
    },
    {
        "start_time": 2950.7,
        "text": " Who knows?"
    },
    {
        "start_time": 2951.7,
        "text": " There may be second COVID coming in."
    },
    {
        "start_time": 2953.7,
        "text": " Who knows?"
    },
    {
        "start_time": 2954.7,
        "text": " There may be travel ban coming in."
    },
    {
        "start_time": 2955.7,
        "text": " So it's better to get it resolved as soon as possible."
    },
    {
        "start_time": 2958.8,
        "text": " Just don't go to the last 10 days."
    },
    {
        "start_time": 2971.8,
        "text": " My prior date is current."
    },
    {
        "start_time": 2973.8,
        "text": " I already interfered in EB3."
    },
    {
        "start_time": 2976.8,
        "text": " Do I need to send a letter?"
    },
    {
        "start_time": 2978.8,
        "text": " Any letter for attention again?"
    },
    {
        "start_time": 2980.8,
        "text": " I mean, it's always good if the prior date is current."
    },
    {
        "start_time": 2984.9,
        "text": " You should contact the congressman, ombudsman or send a letter to the USC as to act on it."
    },
    {
        "start_time": 2990.9,
        "text": " There's also another option."
    },
    {
        "start_time": 2992.9,
        "text": " People are asking questions."
    },
    {
        "start_time": 2994.9,
        "text": " Can you file a lawsuit?"
    },
    {
        "start_time": 2996.9,
        "text": " Yes, you can."
    },
    {
        "start_time": 2998.9,
        "text": " Typically, how long does it take to get some result once you file a lawsuit?"
    },
    {
        "start_time": 3000.9,
        "text": " 70 days, it's not guaranteed."
    },
    {
        "start_time": 3002.9,
        "text": " But typically, 70 days is the time that it takes once you file a lawsuit to get any meaningful result."
    },
    {
        "start_time": 3009.0,
        "text": " Nogendra says, do we still have the H4EAD automatic extension to 540 days if the H4 is already approved and the EAD extension is in progress?"
    },
    {
        "start_time": 3024.0,
        "text": " Yes, that is still there."
    },
    {
        "start_time": 3026.0,
        "text": " And you are correct that you do have to have the H4 extension already approved in order for that to work."
    },
    {
        "start_time": 3032.0,
        "text": " So if you've just filed your H4 and your H4EAD renewals, that's not enough."
    },
    {
        "start_time": 3038.1,
        "text": " You need to have the H4 approval extending beyond the EAD validity period and the I765 receipt notice for the H4EAD extension."
    },
    {
        "start_time": 3048.1,
        "text": " Those combined do give you the 540-day auto extension."
    },
    {
        "start_time": 3052.1,
        "text": " Any news on H4EAD removal?"
    },
    {
        "start_time": 3057.1,
        "text": " Navin Kumar is asking the question."
    },
    {
        "start_time": 3059.1,
        "text": " No news at this point of time."
    },
    {
        "start_time": 3061.1,
        "text": " Do we make it by end of this month what regulations they want to issue?"
    },
    {
        "start_time": 3067.2,
        "text": " Probably by May we should be getting something from this administration about the intent to do with the regulations of the H4EAD."
    },
    {
        "start_time": 3075.2,
        "text": " But at this point of time, as of today, March 11th, nothing is there."
    },
    {
        "start_time": 3079.2,
        "text": " You can still file the extension or proposal for canceling the H4EAD at this point of time."
    },
    {
        "start_time": 3085.3,
        "text": " I'm planning to go to India for three or four months."
    },
    {
        "start_time": 3092.3,
        "text": " Can my employer file an H1B if I got selected in the lottery in the master's cap?"
    },
    {
        "start_time": 3098.3,
        "text": " Yes, you don't need to be in the US to go through the lottery or to have the H1B petition filed."
    },
    {
        "start_time": 3104.3,
        "text": " So once you're selected, your company would file an H1B requesting consular processing."
    },
    {
        "start_time": 3109.3,
        "text": " Once it's approved, you go to the consulate, get the visa stamped, and then you can come back to the US."
    },
    {
        "start_time": 3114.4,
        "text": " No earlier than October 1st."
    },
    {
        "start_time": 3117.4,
        "text": " Technically, you can come in 10 days before October 1st."
    },
    {
        "start_time": 3120.4,
        "text": " But basically October 1st."
    },
    {
        "start_time": 3121.4,
        "text": " Arun Kumar has completed the H4EAD interview in May 2024."
    },
    {
        "start_time": 3125.4,
        "text": " Prior to it is not current."
    },
    {
        "start_time": 3127.4,
        "text": " What are the chances he's going to get the interview in the future?"
    },
    {
        "start_time": 3131.4,
        "text": " At this point of time, I would say that it's less than 5%."
    },
    {
        "start_time": 3134.4,
        "text": " But you never know."
    },
    {
        "start_time": 3136.4,
        "text": " This administration might say that if somebody is not interviewed, they should be interviewed every two years, every one year."
    },
    {
        "start_time": 3141.5,
        "text": " We don't know if they would come up with any of the policies."
    },
    {
        "start_time": 3144.5,
        "text": " But as of now, it's less than 5% chance you'll be interviewed again."
    },
    {
        "start_time": 3153.5,
        "text": " Venkatesh says, my current employer where I have the job and receive my monthly paychecks is not filing my H1B."
    },
    {
        "start_time": 3161.5,
        "text": " And this is my last chance on the STEM OPT."
    },
    {
        "start_time": 3164.5,
        "text": " Can I find another employer to file my H1B?"
    },
    {
        "start_time": 3168.6,
        "text": " Maybe."
    },
    {
        "start_time": 3170.6,
        "text": " But there's risk here if you're thinking just some random employer that's saying, yeah, sure, I'll submit it."
    },
    {
        "start_time": 3178.6,
        "text": " Give me $215 and I'll submit you in the lottery."
    },
    {
        "start_time": 3181.6,
        "text": " And you know nothing about this company."
    },
    {
        "start_time": 3183.6,
        "text": " You don't know how many other people they're doing that for."
    },
    {
        "start_time": 3186.6,
        "text": " These companies ultimately end up getting all of their H1Bs revoked."
    },
    {
        "start_time": 3191.6,
        "text": " Because they did not actually have work or projects when they filed the H1B petition."
    },
    {
        "start_time": 3196.7,
        "text": " So that's a big risk."
    },
    {
        "start_time": 3198.7,
        "text": " If you were asking me, I'm working at Google and Facebook is saying they'll sponsor me even though Google won't."
    },
    {
        "start_time": 3206.7,
        "text": " Okay, that's fine."
    },
    {
        "start_time": 3207.7,
        "text": " That's Facebook."
    },
    {
        "start_time": 3208.7,
        "text": " I get that."
    },
    {
        "start_time": 3209.7,
        "text": " But if you're working for consulting company A and consulting company XYZ is going to sponsor you and you've never worked for them."
    },
    {
        "start_time": 3216.7,
        "text": " They're going to find a project for you later or they're going to put you on an in-house project."
    },
    {
        "start_time": 3221.7,
        "text": " No, that's a huge risk."
    },
    {
        "start_time": 3223.8,
        "text": " I have a question."
    },
    {
        "start_time": 3224.8,
        "text": " My wife is a dentist and healthcare worker and she applied H4EAD and saw in USA's website it can expedite request process."
    },
    {
        "start_time": 3232.8,
        "text": " Do you support such cases?"
    },
    {
        "start_time": 3234.8,
        "text": " Yes, but this is not, you don't have to hire a DNA PC for it though."
    },
    {
        "start_time": 3238.8,
        "text": " You can contact them directly."
    },
    {
        "start_time": 3240.8,
        "text": " It's an easy step."
    },
    {
        "start_time": 3241.8,
        "text": " We don't recommend to hire a lawyer for it."
    },
    {
        "start_time": 3244.8,
        "text": " And we see very, I mean, they do honor the healthcare workers as long as your, the healthcare worker is touching the project."
    },
    {
        "start_time": 3253.7,
        "text": " They're not touching the patient."
    },
    {
        "start_time": 3254.7,
        "text": " Dentist definitely touches the patient."
    },
    {
        "start_time": 3256.7,
        "text": " So they definitely fall into the category and their EAD will be expedited."
    },
    {
        "start_time": 3265.7,
        "text": " He just says my three year H1B extension was approved after my I-140 approval and the new valid until date is shown as 2028 on the I-797 approval notice."
    },
    {
        "start_time": 3277.7,
        "text": " But the I-94 online still has my old expiration date in January 2025."
    },
    {
        "start_time": 3283.7,
        "text": " Is that a concern?"
    },
    {
        "start_time": 3284.7,
        "text": " Not at all."
    },
    {
        "start_time": 3285.7,
        "text": " That's completely normal."
    },
    {
        "start_time": 3286.7,
        "text": " So the online I-94 is only updates when you enter the US next time."
    },
    {
        "start_time": 3293.7,
        "text": " So when you get an approval with USCIS, that is USCIS giving the approval."
    },
    {
        "start_time": 3298.7,
        "text": " It has nothing to do with CBP, which is the online version."
    },
    {
        "start_time": 3302.7,
        "text": " So your USCIS I-94 is on your I-797 approval notice."
    },
    {
        "start_time": 3307.7,
        "text": " That's the correct I-94."
    },
    {
        "start_time": 3309.7,
        "text": " You don't use the online one."
    },
    {
        "start_time": 3311.7,
        "text": " Next time you travel, then you'll use the online one."
    },
    {
        "start_time": 3314.7,
        "text": " And that's when you want to make sure that that date is approved."
    },
    {
        "start_time": 3317.7,
        "text": " Runea has this question."
    },
    {
        "start_time": 3319.7,
        "text": " F2 visa got rejected to 214B."
    },
    {
        "start_time": 3322.7,
        "text": " What's the reason?"
    },
    {
        "start_time": 3324.7,
        "text": " Well, every person is considered to be an intending immigrant into the United States."
    },
    {
        "start_time": 3330.7,
        "text": " It's the duty of the applicant to prove it otherwise."
    },
    {
        "start_time": 3333.7,
        "text": " You might have seen in the movies, hey, the person is innocent until proven guilty, not true in immigration."
    },
    {
        "start_time": 3340.7,
        "text": " It's the otherwise, you have to prove that you are innocent."
    },
    {
        "start_time": 3345.7,
        "text": " You have an intention to go back to your home country."
    },
    {
        "start_time": 3348.7,
        "text": " So F2 visa getting rejected with 214B is very common."
    },
    {
        "start_time": 3353.7,
        "text": " I would say that especially for Indian nationals, we see a lot of F2s getting rejected"
    },
    {
        "start_time": 3359.7,
        "text": " because of 214."
    },
    {
        "start_time": 3362.7,
        "text": " There's not much lawyers can do help also if you have a consultation with an immigration lawyer."
    },
    {
        "start_time": 3368.7,
        "text": " We may not be of that great help."
    },
    {
        "start_time": 3377.7,
        "text": " Praveen says, what is the age for the kids to get registered for this alien registration?"
    },
    {
        "start_time": 3384.7,
        "text": " So if the kid got the visa stamp at the consulate after age 14, they would have had their biometrics done and then interviewed for the visa and then come into the US issued in I-94."
    },
    {
        "start_time": 3402.7,
        "text": " They are already registered."
    },
    {
        "start_time": 3404.7,
        "text": " No action needed."
    },
    {
        "start_time": 3406.7,
        "text": " If the kid came into the US before they turned 14 and they're not yet 14, no need to register right now."
    },
    {
        "start_time": 3414.7,
        "text": " When they turn 14, you need to register them within 30 days."
    },
    {
        "start_time": 3419.7,
        "text": " For those that came into the US before they were 14 and have already turned 14, we would recommend registering now within 30 days of when that registration rule came out to go ahead and do that now so that their biometrics can be taken."
    },
    {
        "start_time": 3435.7,
        "text": " This is raised by Ganesh Khashen that the I-84 expired their filing a non-protect argument."
    },
    {
        "start_time": 3445.7,
        "text": " He's also asking if the denial, is there a chance that he may be issued notice to appear?"
    },
    {
        "start_time": 3452.7,
        "text": " Yes, there is a chance for it."
    },
    {
        "start_time": 3455.7,
        "text": " There is a chance for it."
    },
    {
        "start_time": 3456.7,
        "text": " We have to be very careful in applying the NPT now because they may issue notice to appear where we are just putting our hand into a lion's den and saying if the lion will bite it."
    },
    {
        "start_time": 3470.7,
        "text": " Definitely that need to be considered when filing an NPT."
    },
    {
        "start_time": 3475.7,
        "text": " Especially if the children are under 18, though they don't have an unlawful presence, probably that may be fine, but if they're above 18, taking an NPT under the Trump administration is very risky."
    },
    {
        "start_time": 3489.7,
        "text": " Anything else, Emily?"
    },
    {
        "start_time": 3492.7,
        "text": " Last question, Rafi says the H-1B 2026 registration is open."
    },
    {
        "start_time": 3497.7,
        "text": " Do you see any changes in the process or application details needed?"
    },
    {
        "start_time": 3502.7,
        "text": " No, so it is open. We've been starting to register."
    },
    {
        "start_time": 3506.7,
        "text": " We always wait and don't do it on the first day because it's very glitchy."
    },
    {
        "start_time": 3510.7,
        "text": " As reports again this year said it was very glitchy."
    },
    {
        "start_time": 3514.7,
        "text": " So I started my registrations. The process is exactly the same."
    },
    {
        "start_time": 3518.7,
        "text": " Information need is exactly the same."
    },
    {
        "start_time": 3521.7,
        "text": " The only difference is the filing fee."
    },
    {
        "start_time": 3523.7,
        "text": " It went from $10 to $215."
    },
    {
        "start_time": 3526.7,
        "text": " Thank you guys for tuning in. The next bulletin we're going to bring it every Tuesday between 5 to 6 PM. We do take live questions."
    },
    {
        "start_time": 3534.7,
        "text": " If you want to speak with me or Emily or any of our colleagues, you can always make an appointment."
    },
    {
        "start_time": 3539.7,
        "text": " Our schedule is available online at rnlawgroup.com."
    },
    {
        "start_time": 3543.7,
        "text": " We do have a daily free Zoom conference call."
    },
    {
        "start_time": 3546.7,
        "text": " You can log into rnlawgroup.com and you have that free Zoom call."
    },
    {
        "start_time": 3551.7,
        "text": " It will be live questions and answers."
    },
    {
        "start_time": 3555.7,
        "text": " Rebekah Chen will be answering these questions."
    },
    {
        "start_time": 3558.7,
        "text": " Don't forget to subscribe to our newsletter at rnlawgroup."
    },
    {
        "start_time": 3561.7,
        "text": " If there are any updates, we will update immediately so that you can get the information as soon as the things arrive."
    },
    {
        "start_time": 3568.7,
        "text": " Thank you for tuning in."
    }
]